https://www.shanelynn.ie/merge-join-DataFrames-python-pandas-index-1/

In [3]:
import pandas as pd
a=pd.read_csv('C:\\Users\\HP PAVILION GAMING\\OneDrive\\Рабочий стол\\PythonUS\\1.csv')
a.head()

   outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id
0                    21.97                    4.82     1557.33   22787
1                  1710.08                  136.88     7267.55   22788
2                  1710.08                  136.88     7267.55   22789
3                    94.46                   35.17      519.12   22790
4                    71.59                   79.26     1557.33   22792

In [4]:
import numpy as np
a.shape

(240, 4)

In [6]:
b=pd.read_csv('C:\\Users\\HP PAVILION GAMING\\OneDrive\\Рабочий стол\\PythonUS\\2.csv')
b.head()

   use_id  user_id platform  platform_version     device  use_type_id
0   22782    26980      ios              10.2  iPhone7,2            2
1   22783    29628  android               6.0    Nexus 5            3
2   22784    28473  android               5.1   SM-G903F            1
3   22785    15200      ios              10.2  iPhone7,2            3
4   22786    28239  android               6.0  ONE E1003            1

In [7]:
b.shape

(272, 6)

In [8]:
result = pd.merge(a, b[['use_id', 'platform','device']],
                 on='use_id')
result.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F

In [9]:
result.shape # bu yerda a va b fayldagi 'use_id' ustuni bo'yicha faqat bir xil ma]lumotlar ishtirok etadi. 
#Shuning uchun unda qatorlar soni kamayishi mumkin

(159, 6)

In [10]:
print("a dimention: {}".format(a.shape))
print("b dimention: {}".format(b.shape))
print("result dimention: {}".format(result.shape))

a dimention: (240, 4)
b dimention: (272, 6)
result dimention: (159, 6)

In [11]:
# ikkita faylning asosiy birlashtiruvchi ustunlaridagi bir xil belgilarni topamiz
a['use_id'].isin(b['use_id']).value_counts() # demak 159 tasi bir xil ekan

True     159
False     81
Name: use_id, dtype: int64

In [ ]:
# merge(left, right, how, on, left_on, right_on, left_index, right_index, sort, suffixes, copy, indicator, validate)

In [ ]:
https://www.tutorialspoint.com/python_pandas/python_pandas_merging_joining.htm

# how = left da faqat chap tomonni to'laqonli ma'lumot bilan va o'ng tomonni esa bo'sh (NAN) kataklar bilan ham chiqaradi.Masalan,
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print pd.merge(left, right, on='subject_id', how='left')

output:

Name_x   id_x   subject_id   Name_y   id_y
0     Alex      1         sub1      NaN    NaN
1      Amy      2         sub2    Billy    1.0
2    Allen      3         sub4    Brian    2.0
3    Alice      4         sub6    Bryce    4.0
4   Ayoung      5         sub5    Betty    5.0

In [ ]:
# how = right da faqat o'ng tomonni to'laqonli ma'lumot bilan va chap tomonni esa bo'sh (NAN) kataklar bilan ham chiqaradi.Masalan,
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print pd.merge(left, right, on='subject_id', how='right')

output: 

Name_x  id_x   subject_id   Name_y   id_y
0      Amy   2.0         sub2    Billy      1
1    Allen   3.0         sub4    Brian      2
2    Alice   4.0         sub6    Bryce      4
3   Ayoung   5.0         sub5    Betty      5
4      NaN   NaN         sub3     Bran      3

In [ ]:
# how = outer da faqat o'ng va chap tomonni bo'sh (NAN) kataklar bilan ham chiqaradi.Masalan,
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print pd.merge(left, right, how='outer', on='subject_id')

output:

   Name_x  id_x   subject_id   Name_y   id_y
0     Alex   1.0         sub1      NaN    NaN
1      Amy   2.0         sub2    Billy    1.0
2    Allen   3.0         sub4    Brian    2.0
3    Alice   4.0         sub6    Bryce    4.0
4   Ayoung   5.0         sub5    Betty    5.0
5      NaN   NaN         sub3     Bran    3.0

In [ ]:
# how = inner da faqat o'ng va chap tomonni to'liq ma'lumot bilan chiqaradi.Masalan,
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print pd.merge(left, right, on='subject_id', how='inner')

output:

    Name_x   id_x   subject_id   Name_y   id_y
0      Amy      2         sub2    Billy      1
1    Allen      3         sub4    Brian      2
2    Alice      4         sub6    Bryce      4
3   Ayoung      5         sub5    Betty      5

In [ ]:
chphmeeclipe['all_categories_sum']=chphmeeclipe + chphmeeclipe + chphmeeclipe + chphmeeclipe + chphmeeclipe + chphmeeclipe